import React from 'react';
import ServicePage from '../components/ServicePage';

const FamilyTherapy = () => {
  return (
    <ServicePage
      title="Θεραπεία Ζεύγους/Οικογενειακή Θεραπεία"
      description="Η Θεραπεία Ζεύγους και η Οικογενειακή Θεραπεία επικεντρώνονται στη βελτίωση των σχέσεων μεταξύ των μελών της οικογένειας ή του ζεύγους. Στόχος αυτής της θεραπείας είναι η ανάπτυξη καλύτερης επικοινωνίας, η επίλυση συγκρούσεων και η ενίσχυση της συναισθηματικής σύνδεσης, βοηθώντας τα μέλη να κατανοήσουν και να υποστηρίξουν το ένα το άλλο."
      benefits={[
        { title: "Βελτίωση Επικοινωνίας", description: "Η θεραπεία βοηθά τα μέλη να εκφράζουν τις σκέψεις και τα συναισθήματά τους πιο ανοιχτά και αποτελεσματικά, μειώνοντας τις παρανοήσεις και τις συγκρούσεις." },
        { title: "Ενίσχυση Εμπιστοσύνης", description: "Μέσω της θεραπείας, αναπτύσσεται η εμπιστοσύνη μεταξύ των μελών, επιτρέποντας την οικοδόμηση πιο σταθερών και υποστηρικτικών σχέσεων." },
        { title: "Αντιμετώπιση Συγκρούσεων", description: "Παρέχονται στρατηγικές για την επίλυση συγκρούσεων και τη διαχείριση δύσκολων καταστάσεων με υγιή και εποικοδομητικό τρόπο." },
        { title: "Συναισθηματική Σύνδεση", description: "Η θεραπεία ενισχύει τη συναισθηματική σύνδεση και την κατανόηση μεταξύ των μελών." },
        { title: "Ανάπτυξη Δεξιοτήτων Συνεργασίας", description: "Βοηθά τα μέλη να συνεργάζονται και να λειτουργούν ως ομάδα, βελτιώνοντας τη δυναμική και την αλληλοκατανόηση." },
        { title: "Αίσθηση Ανήκειν", description: "Ενισχύει την αίσθηση της ενότητας και της συμμετοχής στην ομάδα ή στην οικογένεια, μειώνοντας την απομόνωση και την αίσθηση μοναξιάς." }
      ]}
      targetGroup="Η Θεραπεία Ζεύγους και Οικογενειακή Θεραπεία είναι κατάλληλες για ζευγάρια και οικογένειες που αντιμετωπίζουν προβλήματα όπως προβλήματα επικοινωνίας, συναισθηματική αποστασιοποίηση, σύγκρουση ρόλων, αντιμετώπιση κρίσεων ή απώλειες, και άλλες συναισθηματικές και συμπεριφορικές δυσκολίες που επηρεάζουν την ομαλή λειτουργία της σχέσης ή της οικογένειας."
      sessionStructure="Οι συνεδρίες πραγματοποιούνται συνήθως εβδομαδιαία και διαρκούν περίπου 60-90 λεπτά. Κάθε συνεδρία επικεντρώνεται σε συγκεκριμένα θέματα που επιλέγονται από τα μέλη και τον θεραπευτή, και περιλαμβάνει τόσο ομαδική όσο και ατομική συζήτηση. Ο θεραπευτής καθοδηγεί τις συζητήσεις με στόχο την κατανόηση και την επίλυση των προβλημάτων, προσφέροντας παράλληλα τεχνικές και στρατηγικές για την ενίσχυση των δεξιοτήτων επικοινωνίας και της ενσυναίσθησης."
      confidentiality="Η εμπιστευτικότητα διασφαλίζεται πλήρως σε κάθε συνεδρία."
      startInfo="Για να ξεκινήσετε με τη Θεραπεία Ζεύγους ή Οικογενειακή Θεραπεία, το πρώτο βήμα είναι να επικοινωνήσετε μαζί μου για μια αρχική αξιολόγηση. Κατά τη διάρκεια αυτής της πρώτης συνεδρίας, θα συζητήσουμε τις ανάγκες σας, θα εξηγήσω τον τρόπο λειτουργίας της θεραπείας και θα βοηθήσω στον καθορισμό των στόχων σας. Από εκεί και πέρα, θα καθοριστεί ένα πλάνο θεραπείας που θα προσαρμοστεί στις ιδιαίτερες ανάγκες της σχέσης ή της οικογένειάς σας."
      prevService={{ title: "Κατ'οίκον συνεδρία", link: "/home-therapy" }}
      nextService={{ title: "Ψυχολογικές Αξιολογήσεις", link: "/test-therapy" }}
    />
  );
};

export default FamilyTherapy;
