import React from 'react';
import ServicePage from '../components/ServicePage';

const HomeTherapy = () => {
  return (
    <ServicePage
      title="Κατ'οίκον Συνεδρίες"
      description="Οι κατ' οίκον συνεδρίες είναι μια μορφή θεραπείας 
      όπου ο θεραπευτής επισκέπτεται τον πελάτη στον δικό του χώρο, 
      προσφέροντας ψυχολογική υποστήριξη και συμβουλευτική σε ένα 
      περιβάλλον όπου ο πελάτης νιώθει άνετα και ασφαλής. Αυτή η προσέγγιση είναι 
      ιδανική για άτομα που δυσκολεύονται να βγουν από το σπίτι τους, είτε λόγω σωματικών 
      περιορισμών, άγχους, είτε για άλλους προσωπικούς λόγους."
      benefits={[
        { title: "Άνεση και Οικειότητα", description: "Οι συνεδρίες πραγματοποιούνται σε έναν χώρο όπου ο πελάτης αισθάνεται πιο άνετα και ασφαλής, κάτι που μπορεί να ενισχύσει την ειλικρίνεια και τη συνεργασία στη θεραπευτική διαδικασία." },
        { title: "Προσαρμογή στις Ανάγκες του Πελάτη", description: "Ο θεραπευτής μπορεί να προσαρμόσει την προσέγγισή του με βάση τον πραγματικό τρόπο ζωής του πελάτη, λαμβάνοντας υπόψη το περιβάλλον και τις συνθήκες διαβίωσης." },
        { title: "Ευκολία Πρόσβασης", description: "Οι κατ’ οίκον συνεδρίες είναι ιδιαίτερα χρήσιμες για άτομα με κινητικές δυσκολίες, ηλικιωμένους, ή εκείνους που δεν έχουν εύκολη πρόσβαση σε μεταφορικά μέσα ή δημόσια συγκοινωνία." },
        { title: "Εξοικονόμηση Χρόνου", description: "Χωρίς την ανάγκη μετακίνησης, οι συνεδρίες εξοικονομούν χρόνο και ενέργεια για τον πελάτη, καθιστώντας την θεραπεία πιο προσιτή και εύκολη στην ενσωμάτωση στο καθημερινό πρόγραμμα." },
      ]}
      targetGroup="Οι κατ' οίκον συνεδρίες είναι ιδανικές για άτομα που δυσκολεύονται να παρακολουθήσουν συνεδρίες σε ένα παραδοσιακό θεραπευτικό περιβάλλον. Είναι κατάλληλες για όσους αντιμετωπίζουν κινητικές δυσκολίες ή άλλες φυσικές αναπηρίες, ηλικιωμένους που δυσκολεύονται να βγουν από το σπίτι τους λόγω ηλικίας ή υγειονομικών παραγόντων, άτομα με άγχος ή φοβίες όπως αγοραφοβία ή κοινωνική φοβία, καθώς και γονείς με μικρά παιδιά που δεν μπορούν εύκολα να τα αφήσουν για να παρακολουθήσουν συνεδρίες εκτός σπιτιού."
      sessionStructure="Οι συνεδρίες διαρκούν περίπου 50 λεπτά και πραγματοποιούνται συνήθως σε εβδομαδιαία βάση, με στόχο την παροχή ψυχολογικής υποστήριξης σε ένα ασφαλές και οικείο περιβάλλον."
      confidentiality="Η εμπιστευτικότητα και η ασφάλεια διασφαλίζονται πλήρως στην άνεση του σπιτιού σας, προσφέροντας την ευκαιρία για ανοιχτή και ειλικρινή συζήτηση."
      startInfo="Για να ξεκινήσετε με κατ' οίκον συνεδρίες, το πρώτο βήμα είναι να επικοινωνήσετε μαζί μου για να προγραμματίσετε μια αρχική συνάντηση. Σε αυτή τη συνάντηση, θα συζητήσετε τις ανάγκες σας και θα αξιολογήσετε εάν οι κατ' οίκον συνεδρίες είναι η καλύτερη επιλογή για εσάς. Ο θεραπευτής θα σας ενημερώσει για τη διαδικασία, τις προϋποθέσεις και τους όρους για τις κατ' οίκον συνεδρίες, και θα οργανώσετε το πρόγραμμα των συνεδριών ανάλογα με τις ανάγκες σας. Είναι σημαντικό να διασφαλίσετε ότι ο χώρος στο σπίτι σας είναι άνετος και κατάλληλος για μια ήρεμη και εμπιστευτική συνεδρία."
      prevService={{ title: "Online Συνεδρίες", link: "/online-therapy" }}
      nextService={{ title: "Θεραπεία Ζεύγους/Οικογενειακή Θεραπεία", link: "/family-therapy" }}
    />
  );
};

export default HomeTherapy;
