import React from 'react';
import ServicePage from '../components/ServicePage';

const OldTherapy = () => {
  return (
    <ServicePage
      title="Ψυχολογική Υποστήριξη για Ηλικιωμένους"
      description="Η ψυχολογική υποστήριξη για ηλικιωμένους παρέχει έναν ασφαλή και υποστηρικτικό χώρο για την αντιμετώπιση των προκλήσεων που συνδέονται με την τρίτη ηλικία και τις δυσκολίες που αντιμετωπίζουν οι φροντιστές τους."
      benefits={[
        { title: "Μείωση της Μοναξιάς", description: "Η ψυχολογική υποστήριξη βοηθά στην καταπολέμηση της μοναξιάς, προσφέροντας στους ηλικιωμένους την ευκαιρία να μοιραστούν τα συναισθήματα και τις σκέψεις τους σε ένα ασφαλές περιβάλλον." },
        { title: "Διαχείριση Συναισθημάτων", description: "Παρέχεται βοήθεια για την αντιμετώπιση συναισθημάτων όπως άγχος, κατάθλιψη και θλίψη, τα οποία μπορεί να προκύψουν από απώλειες, σωματικές αλλαγές ή αλλαγές στον τρόπο ζωής." },
        { title: "Ενίσχυση Αυτοεκτίμησης", description: "Μέσω της υποστήριξης, οι ηλικιωμένοι ενισχύουν την αυτοεκτίμησή τους και ενθαρρύνονται να διατηρήσουν την ανεξαρτησία τους στο μέγιστο δυνατό βαθμό." },
        { title: "Προσαρμογή σε Νέες Καταστάσεις", description: "Η υποστήριξη διευκολύνει την προσαρμογή σε νέες καταστάσεις όπως η διαμονή σε γηροκομείο ή άλλες αλλαγές στον τρόπο ζωής, παρέχοντας συναισθηματική υποστήριξη και κατευθυντήριες γραμμές." },
      ]}
      targetGroup="Αυτή η υπηρεσία είναι ιδανική για ηλικιωμένους που ζουν είτε στο σπίτι είτε σε γηροκομεία και αντιμετωπίζουν συναισθηματικές ή κοινωνικές προκλήσεις. Είναι κατάλληλη για όσους βιώνουν μοναξιά, απώλειες, άγχος, ή δυσκολίες στην προσαρμογή σε νέες συνθήκες. Επίσης, είναι σημαντική και για την υποστήριξη συγγενών, βοηθώντας τους να κατανοήσουν τις ανάγκες των αγαπημένων τους και να διαχειριστούν τις δικές τους ανησυχίες και συναισθήματα."
      sessionStructure="Οι συνεδρίες είναι ατομικές ή ομαδικές και διαρκούν περίπου 50 λεπτά. Στόχος μου είναι να δημιουργηθεί ένα υποστηρικτικό περιβάλλον όπου οι ηλικιωμένοι και οι συγγενείς τους μπορούν να αισθανθούν άνετα και ασφαλείς να εκφραστούν."
      confidentiality="Όλες οι συνεδρίες είναι αυστηρά εμπιστευτικές και πραγματοποιούνται με σεβασμό στην αξιοπρέπεια και την ασφάλεια των ηλικιωμένων."
      startInfo="Για να ξεκινήσετε με την ψυχολογική υποστήριξη για ηλικιωμένους, επικοινωνήστε μαζί μου για να προγραμματίσετε μια αρχική συνάντηση. Σε αυτήν τη συνάντηση, θα αξιολογήσουμε τις ανάγκες σας και θα καθορίσουμε τον καλύτερο τρόπο για να προχωρήσουμε με τις υπηρεσίες υποστήριξης"
     
      prevService={{ title: "Ψυχολογικές Αξιολογήσεις", link: "/test-therapy" }} 
      nextService={{ title: "Παιδοψυχολογία", link: "/child-therapy" }}
    />
  );
};

export default OldTherapy;
