import React from 'react';
import ServicePage from '../components/ServicePage';
import '../styles/servicePageStyles.css'; // Εισάγεις το νέο CSS αρχείο

const OnlineTherapy = () => {
  return (
    
    <ServicePage
      title="Online Συνεδρίες"
      description="Οι online συνεδρίες είναι ένας σύγχρονος τρόπος παροχής ψυχολογικής υποστήριξης μέσω του διαδικτύου, χρησιμοποιώντας πλατφόρμες βιντεοκλήσης όπως το Zoom, το Skype, ή άλλες ασφαλείς εφαρμογές. Προσφέρουν τη δυνατότητα στους θεραπευόμενους να λαμβάνουν ψυχοθεραπευτικές υπηρεσίες από την άνεση του σπιτιού τους ή από οποιοδήποτε άλλο ιδιωτικό χώρο, χωρίς να απαιτείται φυσική παρουσία στον χώρο του θεραπευτή."
      benefits={[
        { title: "Ευκολία και Προσβασιμότητα", description: "Οι online συνεδρίες επιτρέπουν στους πελάτες να συμμετέχουν στη θεραπεία από οποιοδήποτε μέρος, αρκεί να έχουν πρόσβαση στο διαδίκτυο. Αυτό είναι ιδανικό για άτομα με περιορισμένο χρόνο, ταξιδιωτικές δεσμεύσεις ή για εκείνους που ζουν σε περιοχές χωρίς άμεση πρόσβαση σε θεραπευτές." },
        { title: "Άνεση στον Δικό σας Χώρο", description: "Η δυνατότητα να βρίσκεστε στο δικό σας οικείο περιβάλλον μπορεί να μειώσει το άγχος και να κάνει τη θεραπευτική διαδικασία πιο άνετη και προσιτή." },
        { title: "Ευελιξία Προγραμματισμού", description: "Οι online συνεδρίες παρέχουν περισσότερη ευελιξία στον προγραμματισμό, καθιστώντας ευκολότερο για τους πελάτες να ενσωματώσουν τη θεραπεία στο καθημερινό τους πρόγραμμα." },
        { title: "Συνέχιση της Θεραπείας σε Περίπτωση Απομόνωσης", description: "Εάν κάποιος αντιμετωπίζει περιστάσεις που απαιτούν απομόνωση, όπως σε περιπτώσεις υγείας ή καραντίνας, οι online συνεδρίες επιτρέπουν τη συνέχιση της ψυχολογικής υποστήριξης χωρίς διακοπή." },
        
      ]}
      targetGroup="Οι online συνεδρίες είναι ιδανικές για άτομα που προτιμούν την άνεση και την ευκολία του να βρίσκονται στον δικό τους χώρο, ειδικά αν έχουν πολυάσχολα προγράμματα, κινητικά προβλήματα ή ζουν σε απομακρυσμένες περιοχές. Είναι επίσης κατάλληλες για όσους αισθάνονται πιο άνετα να εκφράζονται σε έναν οικείο χώρο. Ακόμη, είναι κατάλληλη για Έλληνες κατοίκους εξωτερικού, που επιθυμούν να κάνουν ψυχοθεραπεία στη γλώσσα τους."
      sessionStructure="Οι online συνεδρίες πραγματοποιούνται μέσω ασφαλών πλατφορμών βιντεοκλήσης, όπως το Zoom, το Skype, ή άλλες πλατφόρμες που επιλέγονται από κοινού. Κάθε συνεδρία διαρκεί περίπου 50 λεπτά και προγραμματίζεται σε ώρα που σας εξυπηρετεί, προσφέροντας ευελιξία στη θεραπευτική σας πορεία. Οι συνεδρίες ακολουθούν μια δομημένη προσέγγιση που εστιάζει στις προσωπικές σας ανάγκες και στόχους, όπως και στην παραδοσιακή θεραπεία."
      confidentiality="Η διασφάλιση της ιδιωτικότητας και της ασφάλειας των online συνεδριών αποτελεί προτεραιότητα. Όλες οι επικοινωνίες είναι κρυπτογραφημένες, και τα δεδομένα σας προστατεύονται, δημιουργώντας ένα ασφαλές περιβάλλον για να εκφραστείτε χωρίς φόβο κριτικής ή παρεμβολών."
      startInfo="Για να ξεκινήσετε με online συνεδρίες, επικοινωνήστε μαζί μου για να προγραμματίσουμε μια αρχική συνάντηση. Θα συζητήσουμε τις ανάγκες σας και θα καθορίσουμε τον καλύτερο τρόπο για να προχωρήσουμε. Έτσι, μπορείτε να αρχίσετε την πορεία σας προς την αυτοβελτίωση από την άνεση του δικού σας χώρου.

Μη διστάσετε να κάνετε το πρώτο βήμα προς μια πιο υγιή και ισορροπημένη ζωή. Κλείστε τώρα την πρώτη σας"
      prevService={{ title: "Ατομική Θεραπεία", link: "/IndividualTherapy" }}
      nextService={{ title: "Ομαδική Θεραπεία", link: "/group-therapy" }}
    />
  );
};

export default OnlineTherapy;