import React from 'react';
import ServicePage from '../components/ServicePage';

const TestTherapy = () => {
  return (
    <ServicePage
      title="Ψυχολογικές Αξιολογήσεις"
      description="Η υπηρεσία Ψυχολογικών Αξιολογήσεων παρέχει μια ολοκληρωμένη κατανόηση της νοητικής, συναισθηματικής και συμπεριφορικής λειτουργίας των ατόμων. Μέσω της αξιολόγησης, εντοπίζονται οι ανάγκες και οι δυνατότητες των ατόμων, συμβάλλοντας στην ανάπτυξη εξατομικευμένων πλάνων υποστήριξης και παρέμβασης."
      benefits={[
        { title: "Ακριβής Διάγνωση", description: "Η αξιολόγηση βοηθά στην ακριβή διάγνωση ψυχικών διαταραχών, μαθησιακών δυσκολιών ή άλλων ψυχολογικών προκλήσεων, παρέχοντας σαφή εικόνα των αναγκών του ατόμου." },
        { title: "Ανάπτυξη Εξατομικευμένων Πλάνων", description: "Με βάση τα αποτελέσματα της αξιολόγησης, δημιουργούνται εξατομικευμένα πλάνα παρέμβασης και θεραπείας, τα οποία ανταποκρίνονται στις συγκεκριμένες ανάγκες και στόχους του ατόμου." },
        { title: "Ενίσχυση Αυτογνωσίας", description: "Τα αποτελέσματα της αξιολόγησης προσφέρουν στο άτομο πολύτιμες πληροφορίες για τη νοητική του λειτουργία, τις δυνατότητες και τις προκλήσεις του, ενισχύοντας την αυτογνωσία και την αυτοπεποίθησή του." }
      ]}
      targetGroup="Η υπηρεσία απευθύνεται σε παιδιά, εφήβους και ενήλικες που χρειάζονται μια ολοκληρωμένη αξιολόγηση της νοητικής και συναισθηματικής τους κατάστασης. Είναι ιδιαίτερα χρήσιμη για άτομα που αντιμετωπίζουν δυσκολίες στη μάθηση, προβλήματα συμπεριφοράς, ή υποψίες για ψυχικές διαταραχές."
      sessionStructure="Η διαδικασία περιλαμβάνει τη χορήγηση ψυχομετρικών τεστ, όπως τα WISC-V, WPPSI-III GR, και WAIS-IV GR, τα οποία παρέχουν μια αξιόπιστη και επιστημονική μέτρηση της νοητικής λειτουργίας του ατόμου. Τα αποτελέσματα αναλύονται από εμένα και συζητούνται με τον πελάτη ή την οικογένεια του, παρέχοντας σαφείς κατευθυντήριες γραμμές για την περαιτέρω διαχείριση ή παρέμβαση."
      confidentiality="Η όλη διαδικασία διεξάγεται με απόλυτο σεβασμό στην ασφάλεια και την εμπιστευτικότητα των δεδομένων του ατόμου, διασφαλίζοντας ένα ασφαλές και προστατευμένο περιβάλλον."
      startInfo="Για να ξεκινήσετε με την υπηρεσία Ψυχολογικών Αξιολογήσεων, επικοινωνήστε μαζί μου για να προγραμματίσετε μια αρχική συνάντηση. Σε αυτήν τη συνάντηση, θα συζητήσουμε τις ανάγκες και τις προσδοκίες σας, ώστε να καθορίσουμε το κατάλληλο πλάνο αξιολόγησης."

      prevService={{ title: "Θεραπεία Ζεύγους/Οικογενειακή Θεραπεία", link: "/family-therapy" }}
      nextService={{ title: "Ψυχολογική Υποστήριξη για Ηλικιωμένους", link: "/old-therapy" }}
    />
  );
};

export default TestTherapy;