// src/data/metadata.js

const metaData = {
    // Γενικές Σελίδες
    home: {
      title: "Αρχική | Ψυχολόγος στη Θεσσαλονίκη",
      description: "Ανακαλύψτε επαγγελματικές ψυχολογικές υπηρεσίες για υποστήριξη ψυχικής υγείας και ευεξίας. Βρίσκεται στη Θεσσαλονίκη, προσφέρουμε ατομική θεραπεία, θεραπεία ζεύγους, και πολλά άλλα.",
      keywords: "ψυχολογία, θεραπεία, Θεσσαλονίκη, ψυχική υγεία, ψυχολόγος",
    },
    about: {
      title: "Σχετικά με Εμάς | Επαγγελματική Προσέγγιση και Βιογραφικό",
      description: "Μάθετε περισσότερα για το επαγγελματικό υπόβαθρο, την προσέγγιση και την εξειδίκευση μας σε ψυχολογικές υπηρεσίες προσαρμοσμένες στις ανάγκες των ατόμων και των οικογενειών.",
      keywords: "ψυχολόγος, ψυχική υγεία, θεραπεία, επαγγελματικό βιογραφικό",
    },
    contact: {
      title: "Επικοινωνία | Κλείστε Ραντεβού",
      description: "Επικοινωνήστε μαζί μας για ραντεβού, προγραμματισμό και περισσότερες πληροφορίες για τις υπηρεσίες μας.",
      keywords: "επικοινωνία, προγραμματισμός, ραντεβού, ψυχολόγος Θεσσαλονίκη",
    },
  
    // Σελίδες Υπηρεσιών
    individualTherapy: {
      title: "Ατομική Θεραπεία | Προσωπική Ανάπτυξη και Υποστήριξη",
      description: "Εξατομικευμένες συνεδρίες θεραπείας που βοηθούν τα άτομα να αντιμετωπίσουν προσωπικές προκλήσεις, άγχος και θέματα ψυχικής υγείας.",
      keywords: "ατομική θεραπεία, προσωπική ανάπτυξη, διαχείριση άγχους, ψυχολόγος",
    },
    groupTherapy: {
      title: "Ομαδική Θεραπεία | Υποστήριξη και Αλληλεπίδραση",
      description: "Ομαδικές συνεδρίες για κοινοποίηση εμπειριών, αλληλοϋποστήριξη και ανάπτυξη διαπροσωπικών δεξιοτήτων σε ελεγχόμενο περιβάλλον.",
      keywords: "ομαδική θεραπεία, ψυχική υγεία, Θεσσαλονίκη, υποστήριξη",
    },
    onlineTherapy: {
      title: "Online Θεραπεία | Συνεδρίες από το Σπίτι",
      description: "Online συνεδρίες που προσφέρουν ευελιξία και άμεση πρόσβαση σε ψυχολογική υποστήριξη από τον χώρο σας.",
      keywords: "online θεραπεία, εικονικές συνεδρίες, ψυχολογική υποστήριξη",
    },
    homeTherapy: {
      title: "Κατ' Οίκον Θεραπεία | Συνεδρίες στον Προσωπικό σας Χώρο",
      description: "Απολαύστε υπηρεσίες θεραπείας στο σπίτι σας για όσους προτιμούν ένα οικείο περιβάλλον.",
      keywords: "θεραπεία κατ' οίκον, ψυχική υποστήριξη στο σπίτι",
    },
    familyTherapy: {
      title: "Θεραπεία Ζεύγους και Οικογενειακή Θεραπεία | Ενίσχυση των Σχέσεων",
      description: "Θεραπεία για ζευγάρια και οικογένειες που επικεντρώνεται στην επικοινωνία, την επίλυση συγκρούσεων και την ενίσχυση των οικογενειακών σχέσεων.",
      keywords: "οικογενειακή θεραπεία, θεραπεία ζεύγους, Θεσσαλονίκη, ψυχολόγος",
    },
    psychologicalAssessments: {
      title: "Ψυχολογικές Αξιολογήσεις | Αξιολόγηση Ψυχικής Υγείας",
      description: "Εξειδικευμένες ψυχολογικές αξιολογήσεις με αξιόπιστα εργαλεία για την αναγνώριση και την κατανόηση θεμάτων ψυχικής υγείας.",
      keywords: "ψυχολογική αξιολόγηση, ψυχική υγεία, Θεσσαλονίκη",
    },
    supportForSeniors: {
      title: "Υποστήριξη για Ηλικιωμένους | Ψυχολογική Φροντίδα",
      description: "Εξατομικευμένη υποστήριξη για ηλικιωμένα άτομα, αντιμετωπίζοντας θέματα όπως η μοναξιά και η κατάθλιψη.",
      keywords: "υποστήριξη ηλικιωμένων, ψυχική υγεία ηλικιωμένων, ψυχολόγος",
    },
    childTherapy: {
      title: "Παιδοψυχολογία | Υποστήριξη για Παιδιά και Εφήβους",
      description: "Υπηρεσίες για παιδιά και εφήβους με προκλήσεις όπως άγχος, διαταραχές συμπεριφοράς και μαθησιακές δυσκολίες.",
      keywords: "παιδοψυχολογία, θεραπεία για παιδιά, ψυχική υγεία εφήβων",
    },
  
    // Άρθρα
    article_depression: {
      title: "Πώς να Αναγνωρίσετε τα Συμπτώματα της Κατάθλιψης",
      description: "Μάθετε για τα συμπτώματα, τις αιτίες και τις επιλογές θεραπείας της κατάθλιψης για καλύτερη αυτογνωσία και ψυχική υγεία.",
      keywords: "συμπτώματα κατάθλιψης, ψυχική υγεία, Θεραπεία κατάθλιψης",
    },
    article_anxiety: {
      title: "Πώς το Άγχος Επηρεάζει την Υγεία σας και Πώς να το Αντιμετωπίσετε",
      description: "Διαβάστε για τις επιπτώσεις του άγχους στην υγεία σας και στρατηγικές για αποτελεσματική διαχείριση.",
      keywords: "άγχος, ψυχική υγεία, διαχείριση άγχους, Θεραπεία άγχους",
    },
  };
  
  export default metaData;
  